_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_СрокиРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УСОERP_СрокиРабот</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АвторИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОграничения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлительностьПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлительностьПослеПересчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлительностьПослеРастягивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаДлительности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаОбъема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоРаботыПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоРаботыПослеПересчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемРаботы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемРаботыВыполненный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеРаботыПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеРаботыПослеПересчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеРаботыПослеПересчета2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипОграничения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ТипыОграничений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_ПараметрыВыполненияРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УСОERP_ПараметрыВыполненияРабот</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбъемРаботы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаОбъема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоРаботыПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеРаботыПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлительностьПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаДлительности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УСОERP_УтверждениеКалендарногоПланаГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ВидыПланированияСтроительныхРабот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Утверждена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_СрокиРабот/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Отменяет утверждение календарного плана-графика.
//
// Параметры:
//  ДокументСсылка  – ссылка на план-график;
//  Отказ           – признак наличия ошибок.
//
Процедура ОтменитьПризнакУтверждения(ДокументСсылка, Отказ = Ложь) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ДокументСсылка = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ТаблицаЗаписей = ПолучитьТаблицуЗаписей(ДокументСсылка);	
	
	Для Каждого мДанныеЗаписи Из ТаблицаЗаписей Цикл
		
		НаборЗаписей = РегистрыСведений.УСОERP_ПараметрыВыполненияРабот.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.Период.Установить(ДокументСсылка.Дата); 		
		НаборЗаписей.Отбор.ВидПланирования.Установить(мДанныеЗаписи.ВидПланирования);
		НаборЗаписей.Отбор.Работа.Установить(мДанныеЗаписи.Работа);
		
		НаборЗаписей.Прочитать();
		
		НаборЗаписей.Очистить();
		
		НоваяЗапись = НаборЗаписей.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяЗапись, мДанныеЗаписи);
		НоваяЗапись.Утверждена = Ложь;
		
		Попытка
			НаборЗаписей.Записать();
		Исключение
			ТекстСообщения = НСтр("ru = 'Не удалось отменить утверждение календарного план-графика %Ссылка% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", ДокументСсылка);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.Документы.УСОERP_УтверждениеКалендарногоПланаГрафика, ДокументСсылка, ТекстСообщения);
			
		КонецПопытки;

	КонецЦикла;

КонецПроцедуры

Функция  ПолучитьТаблицуЗаписей(ДокументСсылка) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.Период,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.Работа КАК Работа,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ВидПланирования,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.Утверждена,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ОбъемРаботы,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ЕдиницаОбъема,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.НачалоРаботыПлан,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ОкончаниеРаботыПлан,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ДлительностьПлан,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ЕдиницаДлительности,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.АвторИзменения
	|ИЗ
	|	РегистрСведений.УСОERP_ПараметрыВыполненияРабот.СрезПоследних(
	|			&КонецПериода,
	|			Период = &Период
	|				И Работа.Владелец.Владелец = &ОбъектСтроительства
	|				И Утверждена = ИСТИНА) КАК УСОERP_ПараметрыВыполненияРаботСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.Работа,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.Период,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ВидПланирования,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.Утверждена,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ОбъемРаботы,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ЕдиницаОбъема,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.НачалоРаботыПлан,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ОкончаниеРаботыПлан,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ДлительностьПлан,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ЕдиницаДлительности,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.АвторИзменения";
	
	Запрос.УстановитьПараметр("КонецПериода", Новый Граница(ДокументСсылка.Дата, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Период", ДокументСсылка.Дата);
	Запрос.УстановитьПараметр("ОбъектСтроительства",ДокументСсылка.ОбъектСтроительства);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить();
	
	
КонецФункции

#КонецОбласти

#КонецЕсли
